Revit 2024 API
BuiltInFailures.FamilyFailures.DeletingBadFamType Property
 Can't make type "[Family Name]". It will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeletingBadFamType { get; }
Visual Basic
Public Shared ReadOnly Property DeletingBadFamType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeletingBadFamType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace